/**
 * @file main.c
 * @brief メイン処理
 */

#include "typedefine.h"
#include "AES.h"

//-----------------------------------------------------------
//  マクロ定義
//-----------------------------------------------------------


//-----------------------------------------------------------
//  型定義
//-----------------------------------------------------------


//-----------------------------------------------------------
//  プロトタイプ宣言
//-----------------------------------------------------------


//-----------------------------------------------------------
//  変数定義
//-----------------------------------------------------------


//-----------------------------------------------------------
//  関数定義
//-----------------------------------------------------------

/**
 * @brief メイン処理
 * 
 */
void main(void)
{
	U8 plainText[16];
	U8 cipherText[16];
	U8 data[16];

	plainText[0] = 0x00;
	plainText[1] = 0x01;
	plainText[2] = 0x02;
	plainText[3] = 0x03;
	plainText[4] = 0x04;
	plainText[5] = 0x05;
	plainText[6] = 0x06;
	plainText[7] = 0x07;
	plainText[8] = 0x08;
	plainText[9] = 0x09;
	plainText[10] = 0x0A;
	plainText[11] = 0x0B;
	plainText[12] = 0x0C;
	plainText[13] = 0x0D;
	plainText[14] = 0x0E;
	plainText[15] = 0x0F;

	while (1)
	{
		InitializeCryption();
		Encrypt(plainText, cipherText, 1);

		InitializeCryption();
		Decrypt(cipherText, data, 1);
	}
}